CHINESE_INITIALS = [
    'b',
    'c',
    'ch',
    'd',
    'f',
    'g',
    'h',
    'j',
    'k',
    'l',
    'm',
    'n',
    'p',
    'q',
    'r',
    's',
    'sh',
    't',
    'w',
    'x',
    'y',
    'z',
    'zh',
]

CHINESE_MEDIALS = [
    'i',
    'o',
    'u',
]

CHINESE_CORES = [
    'a',
    'ā',
    'á',
    'ǎ',
    'à',

    'e',
    'ē',
    'é',
    'ě',
    'è',

    'i',
    'ī',
    'í',
    'ǐ',
    'ì',

    'o',
    'ō',
    'ó',
    'ǒ',
    'ò',

    'u',
    'ū',
    'ú',
    'ǔ',
    'ù',

    'ü',
    'ǖ',
    'ǘ',
    'ǚ',
    'ǜ',
]

CHINESE_CODAS = [
    'i',
    'n',
    'ng',
    'o',
    'u',
]